UKR_CENSUS_URL = 'http://db.ukrcensus.gov.ua/MULT/Dialog/view.asp?ma=000_0301&ti=%CD%E0%F0%EE%E4%E6%F3%E2%E0%ED%B3%F1%F2%FC+%B3+%F1%EC%E5%F0%F2%ED%B3%F1%F2%FC+%28%ED%E0+1000+%EE%F1%B3%E1+%ED%E0%FF%E2%ED%EE%E3%EE+%ED%E0%F1%E5%EB%E5%ED%ED%FF%29&path=../Quicktables/POPULATION/03/01/&lang=1&multilang=uk'


DEST_TYPES_DICT = {
    1: 'Normal',
    2: 'Uniform',
    3: 'Exponential',
}

TREND_TYPES_DICT = {
    1: 'Constant',
    2: 'Linear',
    3: 'Quadratic',
}

OSHCHAD_BANK_COLUMNS_DICT = {
    1: 'Купівля',
    2: 'Продаж',
    3: 'КурсНбу',
}

UKRCENSUS_COLUMNS_DICT = {
    1: 'Народжуваність загальна',
    2: 'Смертність загальна',
    3: 'Народжуваність в міській місцевості',
    4: 'Смертність в міській місцевості',
    5: 'Народжуваність в сільській місцевості',
    6: 'Смертність в сільській місцевості',
}

PRESS_ANY_KEY = """
/// Натисніть Enter для продовження...
    """

TASK4_CHART = """
    Оберіть вибірку для зняття числових характеристик
    1 - Вибірка ВВ з Задачі 1
    2 - Тренд з Задачі 2
    3 - Адитивна модель з Задачі 3
    0 - Продовжити далі

    """

TASK5_CHART = """
    Оберіть вибірку для зняття числових характеристик
    1 - Дані курсу валют ОщадБанку
    2 - Дані народжуваності та смертності з сайту db.ukrcensus.gov.ua
    0 - Завершити роботу

    """

DIALOG_OSHCHAD_BANK_COLUMNS = """
    Оберіть назву ознаки (показнику) даних котрі будуть представлені вибіркою
    1 - Купівля
    2 - Продаж
    3 - КурсНбу

"""

DIALOG_UKRCENSUS_COLUMNS = """
   Оберіть назву ознаки (показнику) даних котрі будуть представлені вибіркою
    1 - Народжуваність загальна
    2 - Смертність загальна
    3 - Народжуваність в міській місцевості
    4 - Смертність в міській місцевості
    5 - Народжуваність в сільській місцевості
    6 - Смертність в сільській місцевості

"""

# Distribution dialogs
DIALOG_CHOOSE_DISTR = """
    Оберіть бажаний закон розподілу:
    1 - Нормальний
    2 - Рівномірний
    3 - Експоненціальний

    """

DIALOG_DISTR_SIZE = """
    Оберіть бажаний розмір створениої вибірки. Приклад: 1000
"""

DIALOG_UNIFORM_PARAMS = """
    Оберіть параметри вибірки (мінімальне значення, максимальне значення)
    Вводити через пробіл у зазначеному вище порядку. Приклад: -5 5
        
    """
DIALOG_EXPON_DISTR_PARAMS = """
    Вкажіть параметр lambda для функції експоненційного розподілу в десятинному представленні
    Приклад: 1.7

        """
DIALOG_NORMAL_DISTR_PARAMS = """
    Вкажіть параметри sigma та mu для функції нормального розподілу через пробіл у зазначеному порядку.
    Приклад: 2 0

                """
# Trend dialogs
DIALOG_CHOOSE_TREND = """
    1 - Постійна
    2 - Лінійна
    3 - Квадратична

    """
DIALOG_TREND_PARAMS = """
    Оберіть параметри тренду (мінімальне значення, максимальне значення, розмір вибірки)
    Вводити через пробіл у зазначеному вище порядку. Приклад: -5 5 1000

    """
DIALOG_LIN_TREND_PARAMS = """
    Вкажіть параметри градієнту (slope) та перетину (intercept) для функції лінійного тренду
    Вводити через пробіл у зазначеному вище порядку. Приклад: 2 5

        """
DIALOG_QUAD_TREND_PARAMS = """
    Вкажіть параметри квадратичного (a) та лінійного коефіцієнтів (b) та константи (c) для функції квадратичного тренду
    Вводити через пробіл у зазначеному вище порядку [a b c]. Приклад: 2 2 7

        """
DIALOG_CONST_TREND_PARAMS = """
    Вкажіть параметр константи для функції постійного тренду
    Приклад: 8

        """
DIALOG_ANOMALY_GEN = """
    Вкажіть кількість аномалії які будуть розповсюджені випадковим характером у вибірці та множник значення у цих місцях
    Приклад: 50 4

"""

DIALOG_ANOMALY_DETECTION = """
    1 - Ковзне вікно (за середнім значенням)
    2 - Кастомний метод (усереднення вікна навколо пікових значень)

"""

DIALOG_AN_DETECTOR_PARAMS = """
    Вкажіть розмір вікна та коефіцієнт довірчого інтервалу. 
    (Для кастомного методу вікно має довжину n * 2, n індексів перед та n індексів після аномального значення)
    Приклад: 10 1
    
"""

DIALOG_EXTRAPOLATE = """
    Вкажіть інтервал значень на який буде екстрапольовано передбачення тренду
    Приклад: 500

"""